DataProcessors/РасчетСтатистикиПродажИЧастоты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>РасчетСтатистикиПродажИЧастоты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/РасчетСтатистикиПродажИЧастоты/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура РедактироватьПериод(Команда)
	
	СтандартныйПериод = Новый СтандартныйПериод(Объект.ДатаНачала, Объект.ДатаОкончания);
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогРедактирования.Период = СтандартныйПериод;
	Если ДиалогРедактирования.Редактировать() Тогда
		СтандартныйПериод = ДиалогРедактирования.Период;
		Объект.ДатаНачала = СтандартныйПериод.ДатаНачала;
		Объект.ДатаОкончания = СтандартныйПериод.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьСервер()
	
	Обработки.РасчетСтатистикиПродажИЧастоты.РасчитатьДанные(Объект.ДатаНачала, Объект.ДатаОкончания);
	
КонецПроцедуры	

Процедура РасчитатьПотериТип6()
	
	Обработки.РасчетСтатистикиПродажИЧастоты.РасчитатьПотериТип6(Объект.ДатаНачала, Объект.ДатаОкончания);	
	
КонецПроцедуры

Процедура РасчитатьПотериТип1()
	
	Обработки.РасчетСтатистикиПродажИЧастоты.РасчитатьПотериТип1(Объект.ДатаНачала, Объект.ДатаОкончания);	
	
КонецПроцедуры

&НаКлиенте
Процедура Расчитать(Команда)
	
	РасчитатьСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьПотери6(Команда)
	
	РасчитатьПотериТип6();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьПотери1(Команда)
	
	РасчитатьПотериТип1();
	
КонецПроцедуры
